import React from 'react'
import Link from 'next/link'
import { ArrowLeft2 } from 'iconsax-react'

function PrivacyPage() {
  return (
    <main>
      <section className="container">
        <div className="col-span-12 flex flex-col gap-8 py-8">
          {/* Breadcrumb */}
          <div className="flex items-center gap-2">
            <Link href="/" className="text-neutral-8 caption-1">صفحه اصلی</Link>
            <ArrowLeft2 className="w-4 h-4 stroke-neutral-8" />
            <span className="text-neutral-11 caption-1">حریم خصوصی کاربران</span>
          </div>

          {/* Content */}
          <div className="flex flex-col gap-8">
            <div>
              <h1 className="mb-4">حریم خصوصی کاربران</h1>
              <p className="text-neutral-11 body-3 leading-8">ما به حریم خصوصی شما احترام می‌گذاریم و متعهد به حفاظت از آن هستیم. این سیاست، توضیح می‌دهد که ما چه اطلاعاتی را جمع‌آوری و نگهداری می‌کنیم و چگونه از آن استفاده می‌کنیم.</p>
            </div>

            <div>
              <h2 className="mb-4">جمع‌آوری و استفاده از اطلاعات شخصی</h2>
              <p className="text-neutral-11 body-3 mb-4">ما برای ارائه خدمات بهینه، اطلاعات شخصی از شما سیستم این اطلاعات شامل موارد زیر است:</p>
              <ul className="flex flex-col gap-2 text-neutral-11 body-3 list-disc pr-6">
                <li>اطلاعات تماس و هویتی مانند نام، آدرس ایمیل، شماره تلفن و آدرس پستی که برای ارسال سفارشات و ارائه خدمات استفاده می‌شود.</li>
                <li>اطلاعات پرداخت مانند شماره کارت و اطلاعات واریزی‌ها که از طریق درگاه‌های امن پردازش می‌شوند تا هیچگونه اطلاعات مالی شما را در سرورهای خود ذخیره نکنیم.</li>
                <li>اطلاعات فنی مانند آدرس IP، نوع مرورگر، سیستم‌عامل و اطلاعات مربوط به دستگاه شما که برای تحلیل کارکرد و بهبود خدمات جمع‌آوری می‌شود.</li>
              </ul>
            </div>

            <div>
              <h2 className="mb-4">نحوه استفاده از اطلاعات</h2>
              <ul className="flex flex-col gap-2 text-neutral-11 body-3 list-disc pr-6">
                <li>پردازش سفارش‌ها و ارائه خدمات: اطلاعات تماس و هویتی شما برای ثبت و پردازش سفارشات، ارائه خدمات و ارتباطات مربوط به خریدها استفاده می‌شود.</li>
                <li>بهبود تجربه کاربری: با استفاده از اطلاعات جمع‌آوری‌شده از رفتار کاربران، می‌توانیم محصولات و خدمات خود را بهبود دهیم و تجربه خرید بهتری ارائه دهیم.</li>
                <li>تبلیغات و بازاریابی: ممکن است از اطلاعات شما برای ارسال پیشنهادهای ویژه و اطلاعیه‌های مرتبط با خریدهای قبلی یا علاقه‌مندی‌های شما استفاده کنیم.</li>
              </ul>
            </div>

            <div>
              <h2 className="mb-4">نحوه محافظت از اطلاعات شما</h2>
              <ul className="flex flex-col gap-2 text-neutral-11 body-3 list-disc pr-6">
                <li>ما متعهد به حفظ امنیت اطلاعات شما هستیم و از روش‌های پیشرفته امنیتی برای جلوگیری از دسترسی غیرمجاز به داده‌های شما استفاده می‌کنیم.</li>
                <li>علاوه بر این، دسترسی به اطلاعات شما به افراد مجاز محدود می‌شود و تنها برای اهداف مشخص‌شده در این سیاست استفاده می‌شود.</li>
              </ul>
            </div>

            <div>
              <h2 className="mb-4">استفاده از کوکی‌ها</h2>
              <ul className="flex flex-col gap-2 text-neutral-11 body-3 list-disc pr-6">
                <li>ما از کوکی‌ها و فناوری‌های مشابه برای بهبود کارایی و تحلیل عملکرد سایت استفاده می‌کنیم.</li>
                <li>کوکی‌های ما فایل‌های کوچکی هستند که در مرورگر شما ذخیره می‌شوند و به ما کمک می‌کنند تا شما را بشناسیم و تجربه کاربری شما را شخصی‌سازی کنیم.</li>
                <li>اگر تمایل به استفاده از کوکی‌ها ندارید، می‌توانید تنظیمات مرورگر خود را تغییر دهید و کوکی‌ها را غیرفعال کنید. با این‌حال، این اقدام ممکن است منجر به محدود شدن برخی از قابلیت‌های سایت شود.</li>
              </ul>
            </div>

            <div>
              <h2 className="mb-4">به‌روزرسانی و نگهداری اطلاعات</h2>
              <ul className="flex flex-col gap-2 text-neutral-11 body-3 list-disc pr-6">
                <li>ما اطلاعات شما را تنها تا زمانی که برای اهداف ذکر‌شده در این سیاست ضروری باشد نگهداری می‌کنیم.</li>
                <li>اطلاعات مالی و تراکنشی پس از تکمیل فرایند خرید و ارسال کالا بطور کامل حذف می‌شوند.</li>
                <li>همچنین، ممکن است اطلاعات شما را برای اهداف قانونی و بهبود خدمات بصورت ناشناس نگهداری کنیم.</li>
              </ul>
            </div>

            <div className="grid grid-cols-2 gap-8 max-tablet:grid-cols-1">
              <div>
                <h2 className="mb-4">حقوق شما</h2>
                <ul className="flex flex-col gap-2 text-neutral-11 body-3 list-disc pr-6">
                  <li>شما به‌عنوان کاربری دارید که در زمان به اطلاعات شخصی خود دسترسی داشته باشید و آن‌ها را ویرایش کنید.</li>
                  <li>همچنین می‌توانید درخواست غیرفعال‌سازی حساب کاربری خود را ثبت کنید. ما تلاش می‌کنیم تمامی درخواست‌های شما را در کوتاه‌ترین زمان بررسی کنیم.</li>
                  <li>در صورت نیاز به هرگونه تغییر در اطلاعات شخصی خود، می‌توانید از طریق بخش "حساب من" اطلاعات خود را به‌روز کنید.</li>
                </ul>
              </div>

              <div>
                <h2 className="mb-4">مسئولیت شما</h2>
                <ul className="flex flex-col gap-2 text-neutral-11 body-3 list-disc pr-6">
                  <li>مسئولیت حفظ اطلاعات حساب کاربری و رمز عبور شما به‌عهده شماست.</li>
                  <li>لطفاً از اشتراک‌گذاری اطلاعات با دیگران خودداری کنید و از رمزهای قوی برای حساب کاربری خود استفاده کنید.</li>
                  <li>در صورتی که مشکوک به دسترسی غیرمجاز به حساب خود شدید، لطفاً فوراً به ما اطلاع دهید تا اقدامات لازم را انجام دهیم.</li>
                </ul>
              </div>
            </div>
          </div>
        </div>
      </section>
    </main>
  )
}

export default PrivacyPage