export type ProvinceKey =
  | 'esfahan'
  | 'tehran'
  | 'mazandaran'
  | 'khuzestan'
  | 'fars'
  | 'gilan'
  | 'yazd'
  | 'kerman'
  | 'khorasan_razavi'
  | 'azarbaijan_sharghi'
  | 'azarbaijan_gharbi'
  | 'kermanshah'
  | 'zanjan'
  | 'semnan'
  | 'ilam';

type ProvinceInfo = {
  title: string;
  cities: string[];
};
const Province_Cities: Record<ProvinceKey, ProvinceInfo> = {
    esfahan: {
        title: 'اصفهان',
        cities: ['خمینی‌شهر', 'اصفهان', 'ملک‌شهر', 'شاهین‌شهر', 'فولادشهر', 'زرین‌شهر', 'کاشان', 'نجف‌آباد', 'آران و بیدگل', 'گلپایگان', 'مبارکه', 'سمیرم', 'فریدون‌شهر', 'چادگان', 'خور']
    },
    tehran: {
        title: 'تهران',
        cities: ['تهران', 'ری', 'شمیرانات', 'اسلامشهر', 'ورامین', 'شهریار', 'دماوند', 'رباط‌کریم', 'پردیس', 'بومهن', 'تهران‌پارس', 'اندیشه', 'پرند', 'لواسان', 'ملارد']
    },
    mazandaran: {
        title: 'مازندران',
        cities: ['ساری', 'بابل', 'آمل', 'قائم‌شهر', 'نوشهر', 'چالوس', 'رامسر', 'تنکابن', 'فریدون‌کنار', 'بابلسر', 'جویبار', 'نور', 'محمودآباد', 'عباس‌آباد', 'کلاردشت']
    },
    khuzestan: {
        title: 'خوزستان',
        cities: ['اهواز', 'آبادان', 'خرمشهر', 'دزفول', 'شوشتر', 'ایذه', 'باغ‌ملک', 'اندیمشک', 'شوش', 'ماهشهر', 'بهبهان', 'رامهرمز', 'هویزه', 'امیدیه', 'حمیدیه']
    },
    fars: {
        title: 'فارس',
        cities: ['شیراز', 'کازرون', 'مرودشت', 'لار', 'داراب', 'فسا', 'جهرم', 'سپیدان', 'اقلید', 'نورآباد', 'استهبان', 'قیر', 'لامرد', 'نی‌ریز', 'آباده']
    },
    gilan: {
        title: 'گیلان',
        cities: ['رشت', 'انزلی', 'لاهیجان', 'رودبار', 'فومن', 'صومعه‌سرا', 'آستانه‌اشرفیه', 'شفت', 'ماسال', 'طوالش', 'رضوان‌شهر', 'دیلمان', 'املش', 'لنگرود', 'کلاچای']
    },
    yazd: {
        title: 'یزد',
        cities: ['یزد', 'میبد', 'اردکان', 'بافق', 'مهریز', 'اشکذر', 'ابرکوه', 'تفت', 'خاتم', 'زارچ', 'بهاباد', 'چاهک', 'هرات', 'شاهدیه', 'طبس']
    },
    kerman: {
        title: 'کرمان',
        cities: ['کرمان', 'رفسنجان', 'جیرفت', 'بم', 'زرند', 'سیرجان', 'کهنوج', 'بافت', 'رابر', 'انار', 'فهرج', 'ریگان', 'قلعه‌گنج', 'ماهان', 'شهداد']
    },
    khorasan_razavi: {
        title: 'خراسان رضوی',
        cities: ['مشهد', 'نیشابور', 'سبزوار', 'تربت‌حیدریه', 'چناران', 'سرخس', 'قوچان', 'تایباد', 'تربت‌جام', 'کاشمر', 'بردسکن', 'فریمان', 'گناباد', 'خواف', 'کلات']
    },
    azarbaijan_sharghi: {
        title: 'آذربایجان شرقی',
        cities: ['تبریز', 'مراغه', 'مرند', 'اهر', 'شبستر', 'هریس', 'جلفا', 'سراب', 'ورزقان', 'میانه', 'کلیبر', 'بستان‌آباد', 'خسروشاه', 'صوفیان', 'تبریزباغ']
    },
    azarbaijan_gharbi: {
        title: 'آذربایجان غربی',
        cities: ['ارومیه', 'خوی', 'مهاباد', 'بوکان', 'سلماس', 'میاندوآب', 'شاهین‌دژ', 'نقده', 'پیرانشهر', 'اشنویه', 'تکاب', 'چایپاره', 'چالدران', 'سیه‌چشمه', 'بازرگان']
    },
    kermanshah: {
        title: 'کرمانشاه',
        cities: ['کرمانشاه', 'اسلام‌آباد غرب', 'هرسین', 'قصر شیرین', 'سرپل‌ذهاب', 'کنگاور', 'گیلان‌غرب', 'جوانرود', 'روانسر', 'پاوه', 'سنقر', 'بیستون', 'نودشه', 'نوسود', 'کرند']
    },
    zanjan: {
        title: 'زنجان',
        cities: ['زنجان', 'ابهر', 'خرمدره', 'سلطانیه', 'ماهنشان', 'طارم', 'دندی', 'ایجرود', 'قیدار', 'هیدج', 'زنجان‌رود', 'نیکان', 'صائین‌قلعه', 'بیجار', 'پری']
    },
    semnan: {
        title: 'سمنان',
        cities: ['سمنان', 'شاهرود', 'دامغان', 'گرمسار', 'مهدیشهر', 'ایوانکی', 'آرادان', 'میامی', 'بیارجمند', 'دیباج', 'کهن‌دژ', 'سرخه', 'چاشم', 'شهیدیه', 'دیباج']
    },
    ilam: {
        title: 'ایلام',
        cities: ['ایلام', 'دهلران', 'مهران', 'سرابله', 'شیروان چرداول', 'آبدانان', 'بدره', 'دره‌شهر', 'لومار', 'ارکواز', 'ماژین', 'زنجیره', 'چوار', 'موسیان', 'شاه‌آباد']
    }
};
export default Province_Cities
