import React from 'react'
import Link from 'next/link'
import { ArrowLeft2 } from 'iconsax-react'

function TermsPage() {
  return (
    <main>
      <section className="container">
        <div className="col-span-12 flex flex-col gap-8 py-8">
          {/* Breadcrumb */}
          <div className="flex items-center gap-2">
            <Link href="/" className="text-neutral-8 caption-1">صفحه اصلی</Link>
            <ArrowLeft2 className="w-4 h-4 stroke-neutral-8" />
            <span className="text-neutral-11 caption-1">قوانین و مقررات</span>
          </div>

          {/* Content */}
          <div className="flex flex-col gap-8">
            <div>
              <h1 className="mb-4">قوانین و مقررات</h1>
              <p className="text-neutral-11 body-3 leading-8">به وب‌سایت ما خوش آمدید! این وب‌سایت با هدف ارائه خدمات فروش لباس‌های سفارشی و دست‌دوز طراحی شده است. با ورود به وب‌سایت و استفاده از خدمات ما، شما موافقت خود را با تمامی قوانین و شرایط ذکر شده اعلام کرده‌اید.</p>
            </div>

            <div>
              <h2 className="mb-4">شرایط عضویت و ثبت‌نام</h2>
              <ul className="flex flex-col gap-2 text-neutral-11 body-3 list-disc pr-6">
                <li>برای استفاده از خدمات سایت، کاربران باید ابتدا یک حساب کاربری ایجاد کنند.</li>
                <li>اطلاعاتی که در هنگام ثبت‌نام ارائه می‌شود، باید دقیق، کامل و به‌روز باشد.</li>
                <li>این اطلاعات شامل نام، آدرس ایمیل، شماره تماس و سایر موارد مربوطه می‌شود.</li>
                <li>تمامی اطلاعات به‌صورت محرمانه نگهداری شده و ما متعهد به حفظ حریم خصوصی کاربران هستیم.</li>
                <li>عدم ارائه اطلاعات صحیح ممکن است منجر به لغو عضویت و اختلال در ارسال سفارشات شود.</li>
                <li>کاربر باید از امنیت حساب کاربری خود مراقبت کند و در صورت مشاهده هرگونه فعالیت مشکوک، فوراً به ما اطلاع دهد.</li>
                <li>ایجاد حساب کاربری تنها برای افراد بالای ۱۸ سال مجاز است.</li>
              </ul>
            </div>

            <div>
              <h2 className="mb-4">ثبت سفارش</h2>
              <ul className="flex flex-col gap-2 text-neutral-11 body-3 list-disc pr-6">
                <li>کاربران می‌توانند محصولات سفارشی خود را از طریق وب‌سایت ثبت کنند.</li>
                <li>قبل از قطعی شدن سفارش، کاربران باید اندازه‌های سفارشی، رنگ و سایر جزئیات سفارشی‌سازی را انتخاب کنند.</li>
                <li>پس از ثبت سفارش و تأیید آن، تغییر یا لغو سفارش تنها در موارد خاص امکان‌پذیر است و بسته به مرحله‌ای که سفارش در آن قرار دارد، ممکن است هزینه‌های اضافی شامل شود.</li>
                <li>توجه داشته باشید که سفارشات به‌صورت سفارشی‌سازی شده که به‌صورت کامل پرداخت نشده‌اند، مگر در مواردی که اشکال در پرداخت یا با توافق با توضیحات باشد.</li>
                <li>مشتریان موظف هستند قبل پیش از ثبت نهایی سفارش، مقررات را بررسی کنند.</li>
              </ul>
            </div>

            <div>
              <h2 className="mb-4">پرداخت</h2>
              <ul className="flex flex-col gap-2 text-neutral-11 body-3 list-disc pr-6">
                <li>تمامی پرداخت‌ها از طریق درگاه‌های بانکی انجام می‌شود.</li>
                <li>کاربران باید در هنگام پرداخت، دقت لازم را برای ورود اطلاعات کارت و رمز به‌درستی وارد کنند.</li>
                <li>پس از تأیید پرداخت کاربران، یک ایمیل تأیید دریافت خواهد شد که شامل جزئیات سفارش و شماره پیگیری است.</li>
                <li>لازم به ذکر است که تمامی اطلاعات مالی و تراکنش‌های بانکی کاربران به‌صورت رمزنگاری‌شده پردازش می‌شود و ما هیچ‌گونه به این اطلاعات دسترسی نداریم.</li>
                <li>کاربران در صورت بروز هرگونه مشکل در فرآیند پرداخت می‌توانند از طریق پشتیبانی با ما تماس بگیرند.</li>
              </ul>
            </div>

            <div>
              <h2 className="mb-4">شرایط ارسال و تحویل</h2>
              <ul className="flex flex-col gap-2 text-neutral-11 body-3 list-disc pr-6">
                <li>تمامی پرداخت‌ها از طریق درگاه‌های بانکی انجام می‌شود.</li>
                <li>کاربران باید در هنگام پرداخت، دقت لازم را برای ورود اطلاعات کارت و رمز به‌درستی وارد کنند.</li>
                <li>پس از تأیید پرداخت کاربران، یک ایمیل تأیید دریافت خواهد شد که شامل جزئیات سفارش و شماره پیگیری است.</li>
                <li>لازم به ذکر است که تمامی اطلاعات مالی و تراکنش‌های بانکی کاربران به‌صورت رمزنگاری‌شده پردازش می‌شود و ما هیچ‌گونه به این اطلاعات دسترسی نداریم.</li>
                <li>کاربران در صورت بروز هرگونه مشکل در فرآیند پرداخت می‌توانند از طریق پشتیبانی با ما تماس بگیرند.</li>
              </ul>
            </div>

            <div>
              <h2 className="mb-4">سیاست بازگشت کالا</h2>
              <ul className="flex flex-col gap-2 text-neutral-11 body-3 list-disc pr-6">
                <li>ما متعهد به ارائه محصولاتی با کیفیت بالا هستیم.</li>
                <li>با این حال، در صورت بروز مشکل خاص یا اشتباه در سفارش، مشتریان می‌توانند تا ۷ روز کاری پس از تحویل، درخواست بازگشت کالا را ثبت کنند.</li>
                <li>کالای بازگشتی باید در شرایط اولیه و با بسته‌بندی اصلی تا ۱۵ روز بازگردانده شود.</li>
                <li>پس از بررسی کالا توسط تیم کنترل کیفیت و در صورت تأیید مشکل، وجه به حساب مشتری بازگردانده می‌شود یا سفارش جدیدی برای او ارسال می‌گردد.</li>
                <li>توجه داشته باشید که محصولاتی که به‌صورت سفارشی‌سازی شده‌اند، مشمول سیاست بازگشت کالا نمی‌شوند.</li>
                <li>در صورتی که کالایی به دلیل انتخاب نادرست سایز باید بازگردانده شود، هزینه‌های ارسال مجدد بر عهده خریدار خواهد بود.</li>
              </ul>
            </div>

            <div className="grid grid-cols-2 gap-8 max-tablet:grid-cols-1">
              <div>
                <h2 className="mb-4">حفظ حریم خصوصی</h2>
                <ul className="flex flex-col gap-2 text-neutral-11 body-3 list-disc pr-6">
                  <li>ما به حفاظت از اطلاعات شخصی کاربران متعهد هستیم و تمامی اطلاعات محرمانه نگهداری می‌شود.</li>
                  <li>اطلاعات جمع‌آوری‌شده فقط برای ارائه سفارش‌ها، بهبود خدمات و ارتباط با مشتریان استفاده می‌شود.</li>
                  <li>امنیت اطلاعات کاربران با استفاده از روش‌های امنیتی پیشرفته و به‌صورت رمزنگاری‌شده نگهداری می‌شود.</li>
                  <li>در صورت هرگونه تغییر در سیستم‌های امنیتی، مشتریان را مطلع کرده و اقدامات لازم را برای حل مشکل انجام خواهیم داد.</li>
                </ul>
              </div>

              <div>
                <h2 className="mb-4">حقوق مالکیت معنوی</h2>
                <ul className="flex flex-col gap-2 text-neutral-11 body-3 list-disc pr-6">
                  <li>تمامی محتواها، طراحی‌ها، لوگوها، تصاویر و اطلاعات موجود در این وب‌سایت تحت حمایت قوانین کپی‌رایت قرار دارند.</li>
                  <li>هرگونه استفاده یا بازنشر آن‌ها بدون کسب اجازه از ما ممنوع است.</li>
                  <li>کاربران حق دارند از محتوا و تصاویر تنها برای مقاصد شخصی استفاده کنند. هرگونه استفاده تجاری از محتواهای سایت نیازمند کسب مجوز است.</li>
                  <li>در صورتی که محتوایی از کاربران در وب‌سایت منتشر شود، کاربر با ارائه آن، حقوق استفاده و توزیع را محفوظ می‌دارد.</li>
                </ul>
              </div>
            </div>
          </div>
        </div>
      </section>
    </main>
  )
}

export default TermsPage 